{"results":[{"name":"All in Hand Catering London","rating":"5.0 1 REVIEW","desc":"I believe quality food can transform your mood and physical well being. My career started as a hobby - I absolutely love cooking for my family and friends. I worked in an economics environment for ..."},{"name":"Jasper's Catering Services Croydon","rating":"5.0 1 REVIEW","desc":"Jasper’s Catering provides buffet catering services to businesses in Croydon and the surrounding area for meetings, networking lunches, training courses and other corporate events. Customers trust..."},{"name":"Alicedda Catering Services","rating":"5.0 2 REVIEWS","desc":"Our company is comprised of chefs, bar staff and waitresses with years of experience in the industry. With them on board, you need not stress yourself with the food preparation. Enjoy your event as if..."},{"name":"Salad Days","rating":"5.0 1 REVIEW","desc":"All our food is made fresh on the day and delivered and dropped off to you wherever you need it. Everything comes in 100% biodegradable boxes where you can just take off the sleeve and serve."},{"name":"Spice Deli","rating":"5.0 1 REVIEW","desc":"At Spice Deli we celebrate spices from India and the Middle East. We pride ourselves on creating everything (barring the fantastic sourdough bread from an artisanal bakery) in house. We are inspired ..."},{"name":"Kitchen@ Sam Pollard","rating":"5.0 2 REVIEWS","desc":"Sam Pollard Catering provides delicious, bespoke catering for private and corporate events from 20 to 150 people – cocktail parties, afternoon teas, buffets, bowl food and seated dining. Our food ..."},{"name":"Kitchen Secrets","rating":"5.0 5 REVIEWS","desc":"After 9 years as head chef of a large London catering company, I decided to set up my own smaller company in 2008. We are now ourselves a well established London catering firm working in many of ..."},{"name":"Hogfather Catering","rating":"5.0 8 REVIEWS","desc":"We are a friendly and reliable Hog Roast company and our goal is to make your event a real success with our sizzling hog and pig roasts, giving your event the wow factor with a tasty centrepiece. ..."},{"name":"Kiss My Curry","rating":"5.0 1 REVIEW","desc":"Specialist caterer for all occasions focusing on premium pan Indian cuisine with a passion for provenance and meeting dietary requirements"},{"name":"La Dolce Vita","rating":"5.0 1 REVIEW","desc":"My name is Anitha, I have just finished my studies in Business and Hospitality Management. I am Sri Lankan, and my husband Giampaolo is An Italian Chef in the restaurant “Casa Mia”. We can cook and ..."},{"name":"Paella Shack by London Paella School","rating":"5.0 1 REVIEW","desc":"Make your event an unforgettable experience for your guests with our cookery paella and tapas parties. Also, we can cook for you and your guests at your place in your special celebrations, weddings..."},{"name":"Delhi chef ltd","rating":"5.0 1 REVIEW","desc":"At Delhi Chef we are dedicated to providing the best authentic North/South Indian cuisine, we are committed towards our customers as it helps us to provide exceptional food for our customers. Our menu..."},{"name":"Velvindron","rating":"5.0 2 REVIEWS","desc":"With over 20 years of culinary experience from corporate hospitality catering, restaurants, and private individuals, Jean-Michel and his team at Velvindron bring a unique food experience to any event ..."},{"name":"Cooked & Carved Catering Company","rating":"5.0 4 REVIEWS","desc":"Cooked & Carved specialise in BBQs and Spit Roast services, whether it's a Lamb or Hog Roasting, or a BBQ of burgers, chicken, sausages or steak. Our staff are there to cook and serve fresh from the..."},{"name":"Peppercorn Caterers Ltd","rating":"5.0 1 REVIEW","desc":"Delicious and uncomplicated food is the hallmark of Peppercorn. At Peppercorn our food is unique and comprises a mouthwatering fusion of European, African and Afro caribbean fusion. Our dishes..."},{"name":"Chef Laniado","rating":"5.0 2 REVIEWS","desc":"We specialize in Mediterranean/ Middle East cuisine for dinner parties, weddings, and corporate events from canapes to 6-course dinners."},{"name":"Lucknow 2 London","rating":"5.0 5 REVIEWS","desc":"We are two sisters from London who are passionate about bringing fresh and authentic Indian food to your event. Our traditional recipes from Lucknow, India, have been passed down the family over ..."},{"name":"The Graze & Sip Company","rating":"5.0 2 REVIEWS","desc":"Hello there! Thank you for checking out our profile. The Sip & Graze Company is a small business based in Kent, ran by two best friends. We have joined forces and our passions for food & ..."},{"name":"Nicholas Catering (Greek Catering London)","rating":"5.0 1 REVIEW","desc":"For the events that matter. Something for everyone. Hot or cold dishes, starters, mains, and side/extras. We offer a professional catering services that specialise in authentic Greek Cuisine. We cook ..."},{"name":"A.T. @ Home","rating":"5.0 1 REVIEW","desc":"We are a Fine Dining company that offer bespoke catering services to suit all tastes and budgets. We offer services for events such as weddings and celebrations to private dinner parties (great ..."},{"name":"A&G Event Experts","rating":"5 1 REVIEW","desc":"Personally and professionally. Organising events is our life and we love what we do-we promise to deliver the best with that special touch."},{"name":"Private Chef Scott","rating":"5 1 REVIEW","desc":"Lead by Chef Scott Perkins Sometimes we all need some luxury and what better luxury is there than food? Scott can come to your home as a private chef or you could bring the party to us for our ..."},{"name":"T's Fried Scoop","rating":"5 1 REVIEW","desc":"A little about T's Fried Scoop: It's hot and crunchy on the outside and cold on the inside, as the ice cream does not melt! You can get the fried ice cream covered in either breadcrumbs, ..."},{"name":"The Amazing Grazing Co","rating":"5 2 REVIEWS","desc":"We are a local family-run grazing company that pride ourselves on providing beautiful bespoke grazing options Our passion for food and creativity is what makes us stand out!"},{"name":"Angie's Kitchen","rating":"5 1 REVIEW","desc":"Our cuisine includes catering for Caribbean, African, English, and Asian guests. We aim to furnish your special day with innovative ideas whilst providing you with delicious food that will make ..."},{"name":"Happy Plate","rating":"5 4 REVIEWS","desc":"Happy Plate offer clients catering for all their event needs, from small intimate private dining experiences to catering for larger events. All our menus are bespoke and tailored to each event"},{"name":"Bart’s Table","rating":"5 1 REVIEW","desc":"Bart’s Table is a London based grazing food and event catering company. Creating a variety of grazing tables, breakfasts, office lunches, buffets and bespoke food experiences. We serve the west, ..."},{"name":"Creations Catering","rating":"5 1 REVIEW","desc":"At creations catering we believe in good quality mobile catering. With a range of mobile kitchen vans, catering equipment and catering trailers, we have all the tools needed to cater for events of all..."},{"name":"Syed Private Chef and Catering","rating":"5 1 REVIEW","desc":"We offer our professional catering services in order to cover any small group events, special corporate events, conferences, celebrations, weddings, private breakfasts, lunch, and dinner, etc."},{"name":"Eat a Bite","rating":"5 1 REVIEW","desc":"Providing sandwich platters for businesses, events, and parties. Eat a Bite Ltd has over 25 years of catering experience. Outstanding service and delicious sandwich catering"},{"name":"Heavenly Dish","rating":"5 1 REVIEW","desc":"We pride ourselves on creating delicious, vibrant and beautifully presented dishes. Offering canapes, buffets, seated dinners, bowl food, desserts and everything in between. Offering drop-off and ..."},{"name":"Chef4Vegans","rating":"5 1 REVIEW","desc":"Plant-based food be it vegan or vegetarian/gluten-free or free from can still taste, look and be incredible."},{"name":"Cakery Wonderland","rating":"5 2 REVIEWS","desc":"Private and corporate catering in London and the M25 offering fully catered or just delivered service."},{"name":"Materia Lab","rating":"5 7 REVIEWS","desc":"Each menu will feature the freshest, best-quality seasonal ingredients, providing highly customizable service options, based on allergies, needs, preferences, taste. Professional food service, ..."},{"name":"Feed the Village","rating":"5 1 REVIEW","desc":"Feed the Village is a plant-based catering company aiming to provide delicious street food favourites to all. We are named Feed the Village so we can adapt our menu to many different events, cater..."},{"name":"Trayz","rating":"5 1 REVIEW","desc":"Jamaican chef. Our main service (Trayz) is desserts and sweet treats. immaculate banoffee pies, cheesecakes etc. I personally have a very high level of experience as a Chef with hot food also."},{"name":"mix2mix","rating":"5 28 REVIEWS","desc":"Mix2mixcatering provide top quality dishes with an experienced team of chefs and catering assistants.Our food is cooked with love & passion handed down from my mum. We set high standards in delivering..."},{"name":"Ipanema Events","rating":"5 13 REVIEWS","desc":"Ipanema Events provide quality bar and catering services to private and corporate clients, delivering memorable experiences that are unique to every event. With over 10 years of experience in top ..."},{"name":"Rogue Kitchen","rating":"5 9 REVIEWS","desc":"Rogue Kitchen is a street food pop-up specialising in gourmet burgers and fries. We believe food should be packed full of flavour, crafted by passion, accessible to all, but most of all fun! ..."},{"name":"Fooodlife","rating":"5 8 REVIEWS","desc":"Fooodlife Ltd is a bespoke catering company specialises in tailoring our packages to suit our individual clients requirements. We provide a full catering service to include menu design, consultation ..."},{"name":"Lyreb Honey Catering","rating":"5 8 REVIEWS","desc":"We offer a professional and friendly service as well as having a reputation for an innovative, stylish yet contemporary approach. Over 17 years experience in hosting weddings, corporate events and ..."},{"name":"Mizcarib","rating":"5 48 REVIEWS","desc":"whether you need street food, buffet, sit down meal, BBQ, we can discuss your requirements and work with you to make your event food the best."},{"name":"JP Dining","rating":"5 14 REVIEWS","desc":"My name is Elliot Johnson-Paul, I am a young passionate chef with a hunger and desire for success at the highest level. Growing up I loved to help my mum as and when I could in the kitchen. This soon ..."},{"name":"Fergie and Sons Burger Van & Catering","rating":"5 7 REVIEWS","desc":"We are a small family run business. I have over 15-year experience in the catering and hospitality industry. Our staff are fully trained and hold level 2 food hygiene. Our snack van is situated in ..."},{"name":"Raffelinas Caterers","rating":"4.9 30 REVIEWS","desc":"As a long established family run sandwich bar and caterer, Raffelinas has gained an excellent reputation within the party and catering industry and we are still striving to provide you with the best ..."},{"name":"Myg Catering","rating":"4.9 15 REVIEWS","desc":"MYG Catering ltd is the 3rd generation of chefs. We organise catering services for all occasions from 20 to 500 guests ( one number one concern ) contact today for a free quote. We provide linens/..."},{"name":"Bold Fusion","rating":"4.9 15 REVIEWS","desc":"Whether you're seeking a satisfying lunch, a delightful snack, or an impressive spread for your next office event, we have you covered. Our menu is thoughtfully designed to cater to all dietary ..."},{"name":"Sweet Tee's","rating":"4.9 5 REVIEWS","desc":"Our services provide a different approach to creativity and many of our packages can be tailored to you and your event, making your event totally bespoke. We pride ourselves in making sure your ..."},{"name":"Chop & Chip Co","rating":"4.9 224 REVIEWS","desc":"Chop and Chip Co is a specialist BBQ catering company, founded in 2013 with a street food heritage. Fuelled by their desire to offer restaurant quality dishes on-the-go, they set out to create a ..."},{"name":"Claire Cooks Surrey","rating":"4.9 7 REVIEWS","desc":"Over 10 yrs catering experience. Offering home cooked global dishes from locally sourced organic produce. I specialise in hog roasts but also cater for all types of events and corporate catering ..."},{"name":"Food Etc","rating":"4.9 3 REVIEWS","desc":"Our chefs have worked in some of the best hotels in London and Switzerland, bringing their knowledge to the table. They have stood alongside some of the most respected chefs in the industry and are ..."},{"name":"Pimento62 Catering","rating":"4.9 14 REVIEWS","desc":"Pimento’62Catering provides mobile catering services in London. Established in 2017 by Patricia, the company initially offered catering for business functions, market traders and family events. Since ..."},{"name":"The Golden Whisk","rating":"4.9 64 REVIEWS","desc":"The Golden Whisk is a family run business of Essex caterers with a wealth of experience. We cover all locations within the M25 including Essex, London, Kent and Hertfordshire. We are a bespoke ..."},{"name":"Fritto & Via","rating":"4.8 52 REVIEWS","desc":"We serve the all the classics such as Fish & Chips, Gourmet Burgers, Delicious Hotdogs, Breakfast Baps and make you feel nostalgic with our Fish Finger Sandwiches all made in our sunshine yellow ..."},{"name":"Mrs.SW13 Catering & Events","rating":"4.8 7 REVIEWS","desc":"Welcome to Mrs.SW13 Catering & Events! We're an award winning, London based, catering and event company - that specialises in creating events with unique and personal details. Mrs.SW13 has a ..."},{"name":"Cater Express","rating":"4.7 15 REVIEWS","desc":"From our Gourmet Hog Roast to our Private Chef dining, you can relax and enjoy the deliciousness that is Cater Express! Our award winning food has always been the talk of our events."},{"name":"Diane Edwards Food","rating":"4.7 1 REVIEW","desc":"We can offer a stylish range of food for any event including parties, weddings, corporate, location and festivals throughout London and the south east"},{"name":"MY-WAY Kitchen","rating":"4.7 3 REVIEWS","desc":"MY-WAY Kitchen is a retro looking American school bus in which we have fitted a fully commercial self-contained kitchen so we are able to do events ranging from birthday parties, corporate events, ..."},{"name":"Eventfool","rating":"4.7 1 REVIEW","desc":"Competence and experience. Italian style."},{"name":"Chocolate Fountain Birmingham","rating":"4.7 3 REVIEWS","desc":"Having catered for over 1000 events, its no surprise we’ve set the standard for the chocolate fountain hire industry. The expected has been replaced by the new and exciting. With a fleet of the UK’s ..."},{"name":"Parsons Creative Food LTd","rating":"4.7 1 REVIEW","desc":"We work in many venues in London and provide a high standard of food and service on all levels. We look after many corporate and private events and have been established since 1993."},{"name":"Taylor’s Catering UK","rating":"4.7 1 REVIEW","desc":"We offer all catering services for every special and individual occasion however big or small. Canapés, parties, corporate events, weddings, wakes, children’s birthdays and more."},{"name":"Crafty Boys","rating":"4.7 1 REVIEW","desc":"Craft food inspired by the UK’s eclectic street food scene! Ask us for more information."},{"name":"Mint Leaves Catering","rating":"4.5 4 REVIEWS","desc":"From office buffet to garden party, birthday celebration. Mint leaves has exiting menu to offer at very competitive price. We offer food delivery only or along with chef, event manager, equipments and..."},{"name":"Carolscake","rating":"N/A","desc":"Custom cakes and novelty design cakes for any occasion, If you can imagine it I can create it! Each cake is made with care and thought to make it fulfill your cake dreams. We also cater for Cupcakes ..."},{"name":"Cakes by Clarence","rating":"N/A","desc":"At Cakes by Clarence we offer a wide range of high quality cakes for all occasions. Weather its a birthday, engagement, wedding, Christmas party or just the chance to have a party, we can cater to ..."},{"name":"The Garden Catering","rating":"N/A","desc":"Over the years The Garden Catering has have built a large range of high profile clients through high quality fresh food, beautiful presentation, reasonable pricing and a honest personal service. We ..."},{"name":"Mrs P's Patisserie","rating":"N/A","desc":"Mrs P's Patisserie, based in Upminster, Essex provides delicious homemade cupcakes, afternoon tea cakes and handcrafted celebration cakes for all occasions. All our cakes are bake and decorated fresh ..."},{"name":"Sophies Catering Services","rating":"N/A","desc":"Sophie’s Catering Services is an experienced catering company based in East London, providing fresh, delicious, tasteful food to the City, Docklands, East London and Essex Area. We have the best..."},{"name":"Goodwilles","rating":"N/A","desc":"Hog Roast either Catered or DIY. Fully automatic machines. We can also supply Bouncy Castles, Slides, Bungee Runs. Roundabouts and side shows."},{"name":"Aura Rosa Bespoke Cakes & Cupcakes","rating":"N/A","desc":"Using the highest quality, fresh, seasonal and local ingredients - we create distinctive treats, each a delightful little gem with a variety of flavours ranging from the simple to the sublime, along ..."},{"name":"Premier Castles","rating":"N/A","desc":"We hire inflatables such as bouncy castles and inflatable slides as well as fun catering equipment such as hotdog machines, sweetcorn steamers, slush machines, candy floss machines and popcorn ..."},{"name":"KM Events","rating":"N/A","desc":"KM Events is a specialist in authentic indian catering. We cater for events of any size, and have experience in catering for up to 800 people at once. We also provide our own marquees and can provide ..."},{"name":"Warburtons Catering","rating":"N/A","desc":"Warburtons London Caterers are all about great food, fair pricing & expert co-ordination with a professional easy going style & service. Food should be an affordable, enjoyable and sociable experience..."},{"name":"Bespoke Cuisine","rating":"N/A","desc":"BESPOKE CUISINE | In-house & Event Catering Service Creating sublime food using the finest seasonal ingredients; impeccable service, and inspired wine matching. AT HOME: - private lunches and ..."},{"name":"BangWok","rating":"N/A","desc":"We’ll pop the roof on our converted tuk tuk and cook your food fresh on-site. We specialise in one dish, as the best street vendors in Thailand do. Ours is Pad Thai, served straight from the wok..."},{"name":"The Roast of Sherwood","rating":"N/A","desc":"Get your fill of free-range meats fresh from the heat, literally. It’s a free-range street-side-roast-up, carved from a turning spit and delivered straight to your hand, Say no more. In addition to..."},{"name":"Al Enam","rating":"N/A","desc":"We are not just any Middle Eastern catering company. We passionately work with you to tailor your event around you and your guests. Our team adds creativity to your menu and we go beyond the ..."},{"name":"Food By Dish","rating":"N/A","desc":"Food By Dish is one of London’s leading contemporary caterers. Whether you require delicious food for an awards dinner, catering for an intimate wedding or indeed a family fun day BBQ, Food By Dish ..."},{"name":"Keu Banh Mi","rating":"N/A","desc":"We are specialists in Vietnamese Street Food and Banh Mi - the Vietnamese Baguette. We can cater for 1000 or more people at an event, and have done many events for big companies like KMPG etc."},{"name":"Atali Kitchen","rating":"N/A","desc":"Ata’s love for food and creativity, coupled with Ali’s vast experience within marketing and the fashion media world, meant they could deliver something new and fresh to the industry. An elimination..."},{"name":"Chef's Compliments","rating":"N/A","desc":"-"},{"name":"Cocktail Service","rating":"N/A","desc":"Providing you excellent value for money. With over 10 years of experience in the hospitality industry having worked at major venues and events across the UK, we are in the best position to offer ..."},{"name":"The Early Bird","rating":"N/A","desc":"Early Bird has a lot to offer as a place to meet, have a quick snack, a meal or just pop in. Its prime location serves as a great stop over before visiting the market or attending big matches held at ..."},{"name":"Honey and Thyme","rating":"N/A","desc":"We make honest, tasty food and are constantly reminded of this by our clients and those whom we have had the pleasure of cooking for. We have a simple ethos: Buy good locally grown, seasonal ..."},{"name":"Istanbul Lahmacun","rating":"N/A","desc":"We offer one of the most popular and traditional dishes in Turkey - The Lahmacun, a Minced Lamb or Vegetarian -a turkish style pizza- served wrap in a unique style with Mozzarella, Halloumi or Feta ..."},{"name":"Vintage Van Hire London","rating":"N/A","desc":"Our vintage 1955 Citroen H Van is available for dry hire for events, publicity, weddings or just sitting pretty as a prop wherever you need. You can also use our H van to serve simple foods and ..."},{"name":"Odun services","rating":"N/A","desc":"We cater to your events with entertainment, food, fashion, lifestyle through culture!"},{"name":"Spinning Porkies","rating":"N/A","desc":"Spinning Porkies is a Hog Roast and Barbecue event catering company based in London and the Home Counties. Our team can provide your event with the finest and freshest free-range marinated spit-roasts..."},{"name":"D'Lights Event Catering","rating":"N/A","desc":"Delivering an extravagant, personal and professional service, from an intimate dinner for ten to lavish celebrations for 500, every dish from D’lights Event Catering is served with a sense of style ..."},{"name":"Gastro Catering Surrey","rating":"N/A","desc":"Gastro Catering Surrey are a caterer who specialise in corporate event catering, party catering and wedding catering for events in Surrey and London. As a catering company, Gastro Catering offer bowl ..."},{"name":"Gee Star Events Catering","rating":"N/A","desc":"Gee Star Events Catering has been providing a service for six years for both indoor & outdoor catering Caribbean cuisine. We also cater all types of cuisine, our team consists of highly qualified..."},{"name":"Sophie Gosling Food","rating":"N/A","desc":"A Leiths trained chef with high end restaurant experience I now run my own catering business and offer a friendly, tailored approach to your event. I believe that each event is unique and so is the ..."},{"name":"Love Candy Floss","rating":"N/A","desc":"Love Candy Floss established 2005 offers a superb range of delectable catering services including street food vans and funky dessert carts."},{"name":"Rose & Food","rating":"N/A","desc":"My name is Sophie Rose. I am a trained chef, teacher, eater and wannabe food writer. After deciding that food was more than just a hobby, I waved good-bye to the world of advertising in London and..."},{"name":"Pierogi Company","rating":"N/A","desc":"We are a small company with huge passion to the food we make! With over 13 years of experience in serving our homemade dishes to thousands of Londoners we are bound to satisfy your taste buds too. Our..."},{"name":"Home Kitchen","rating":"N/A","desc":"We cater for a variety of events - business and private functions e.g. weddings, christenings, funerals etc providing fresh quality food for finger and fork buffets, as well as speciality canapes, and..."},{"name":"Naughty Brownie","rating":"N/A","desc":"We are a boutique caterer with 25 year plus experience from a restaurant background working in London for many years perfecting our craft always up for a challenge, ready to help with your needs. ..."},{"name":"Supper Story","rating":"N/A","desc":"Regardless of budget, we design your perfect event using only the best local suppliers and seasonal ingredients from the farms and seas of Great Britain. Whether it is a wedding, corporate event, ..."},{"name":"The Suppersmith","rating":"N/A","desc":"Seasonal, delicious produce sourced from sustainable suppliers for any event that requires fun, vibrant and good-mood-inducing food"},{"name":"Mama G Jollof Ltd","rating":"N/A","desc":"Mama G Jollof is an upcoming catering business with the main objective of introducing West African cuisine to the London food scene. We specialise in street food, so we're mobile and able to bring our..."},{"name":"Ruffled Truffle","rating":"N/A","desc":"Ruffled Truffle is an event catering company based in West London. We offer a range of bespoke catering services to private and corporate clients. Whether it’s a product launch, gala dinner, BBQ or ..."},{"name":"Really Rice","rating":"N/A","desc":"Introducing Really Rice, where the curious can travel around the world of flavour. An authentic multicultural experience, served in healthy, sustainable and tasty way!"},{"name":"Webster's Catering","rating":"N/A","desc":"At Webster's, we pride ourselves in offering an excellent takeaway service for your breakfast, lunch or business meeting, which is available for collection or have us deliver to your home or office in..."},{"name":"Indimax Ltd","rating":"N/A","desc":"Here at indimax, great food is what we do. Over the years, we created healthful, customised catering experiences that honor fresh and flavorful cuisine. Contact us to find out how we can cater your ..."},{"name":"Cuzzi Pizza","rating":"N/A","desc":"The key concept is to serve fresh handmade pizza and crepes at any location. The guys can set up in an hour and can adapt to any environment. Bringing great service, personality and tasty food ..."},{"name":"Oat Kitchen","rating":"N/A","desc":"Oat kitchen started in the winter of 2016 trading at farmers markets around London and delivering our now famous vegan nut roasts to customers across the city and South East for the festive season. We..."},{"name":"Traiteur Catering Company","rating":"N/A","desc":"Traiteur is a modern event catering business focused on bringing a fresh, innovative outlook to all varieties of events and a unique twist on dining. From large weddings to corporate functions, from ..."},{"name":"George's Kitchen","rating":"N/A","desc":"We're a catering business working in London and the Home Counties. We design our menus using seasonal and British ingredients."},{"name":"1070 Kitchen","rating":"N/A","desc":"Its name inspired by the date when Jewish people first arrived in this country, 1070 kitchen is Britain’s first retail food brand celebrating the world of Jewish cuisine. Our business has an ..."},{"name":"3 Kitchen Chickens","rating":"N/A","desc":"We are the 3 Kitchen Chickens and we provide healthy salads, gourmet chickens burger /wraps, vegetarians bites, fresh juices and healthy breakfast."},{"name":"Grazing","rating":"N/A","desc":"The most delicious, hassle-free office catering London has to offer. Whether it’s a daily office lunch delivery for the team or corporate event catering to delight your customers, we're experts in ..."},{"name":"Baba Dhaba","rating":"N/A","desc":"Authentic home recipes, from our Pakistani parents to the London street food scene."},{"name":"Personal Chef Kate","rating":"N/A","desc":"Whatever the occasion, we can provide you and your guests with the highest quality experience, leaving you time to enjoy your company. Highly trained and experienced in the preparation of a variety..."},{"name":"Lara Maynard Catering","rating":"N/A","desc":"I offer a range of different catering services. From private hassle-free dinner parties to larger corporate catering, canape parties, healthy ready meals delivered to your door and cookery lessons."},{"name":"Archies Events","rating":"N/A","desc":"Archie’s are all about delivering delicious food. We’re passionate about cooking with seasonal produce & championing British producers, whilst displaying influence’s from all over the world."},{"name":"Island Poké","rating":"N/A","desc":"A classic Hawaiian dish of cubed, marinated fish. Traditionally the local fisherman would haul in their catch, dice it up, season it and eat on the spot. The ‘Poké Bowl’ is a modern approach to this ..."},{"name":"Jaz & Jetz Kitchen E4","rating":"N/A","desc":"We are a small family run business located in North Chingford E4. We cover a wide range of food on our premises along with outside catering options. We mainly specialise in Crepes & Waffles. We also ..."},{"name":"Dinner Ladies","rating":"N/A","desc":"DINNER LADIES is a dynamic London-based catering company offering seasonal food that is delicious and different. Dinner Ladies trained chefs are globally inspired from their experience teaching ..."},{"name":"Spice Wagon","rating":"N/A","desc":"We make authentic Indian curries at home using the finest ingredients sourced locally. We are also health conscious so we use 100% cholesterol free oil in our food."},{"name":"De'Osa Catering & Events","rating":"N/A","desc":"Our menu consists of Nigerian, Ghanaian, Sierra Leonean and Jamaican cuisines. Tell us your event's must-haves and we can make the magic happen and bring your vision to life!"},{"name":"Rupert's Street","rating":"N/A","desc":"We specialise in tasty, healthy vegan food. We create bespoke menus to fit with any event including weddings, parties, canapé events and conference catering to name but a few. We always go the extra ..."},{"name":"Oyster Brothers","rating":"N/A","desc":"Oyster Brothers Company providing very fresh wild oysters from Essex. We are fishing and purifying them ourselves so our product is as fresh as possible. We are selling and shuckin our oysters ..."},{"name":"Lostacos","rating":"N/A","desc":"Lostacos began as a pop-up restaurant called the Quest For Bold Flavour, started by like-minded friends from California, Scotland, Italy and England. In search of the boldest flavours to share with ..."},{"name":"The Bearded Kitchen","rating":"N/A","desc":"A street food kitchen like no other. The Bearded Kitchen set up by Ben and Lilly is a revolution in food on the go. Our journey started as lovers of traditional British country shows and fairs we ..."},{"name":"Ask Mobile Catering","rating":"N/A","desc":"We are an Italian family business, we serve a wide range of food starting from the traditional Italian gelato to a wood oven baked pizza. We serve all type of street and fast food on all our vans and ..."},{"name":"The V Spot","rating":"N/A","desc":"Plant based bespoke catering"},{"name":"Yum and Bass Salads","rating":"N/A","desc":"Yum & Bass Street Food has a simple concept: To take salads to a whole new level. We strive to create a mouthwatering experience, where diners come to try our delicately spiced vegetables, slow cooked..."},{"name":"Fat Macy's","rating":"N/A","desc":"Fat Macy's is a social enterprise serving delicious home cooked food and dining experiences at supper clubs, events and offices across London. We train aspiring chefs to serve up food with heart, ..."},{"name":"SAM's Caribbean Kitchen","rating":"N/A","desc":"Providing fresh and tasty Authentic Caribbean food. Feel free to contact me if you have any enquiries, Or head over to my Instagram or Facebook page for where you can contact me also. Thanks in ..."},{"name":"The Greek Way","rating":"N/A","desc":"We provide services for Any Greek and Mediterranean recipe."},{"name":"Bread & Honey Catering","rating":"N/A","desc":"Bread & Honey is one of the top catering companies in London and has been serving to some of the world’s most high profile businesses. If you are looking for the best catering service — Bread & Honey..."},{"name":"Maala Dining and Events","rating":"N/A","desc":"We offer the most delectable Indian, Punjabi, Pakistani, Gujarati & South Indian cuisines with pure vegetarian, Jain and halal options. We are a family run catering company that takes pride in ..."},{"name":"Sweet Pea Food Company","rating":"N/A","desc":"We are a family run business, Mother & Daughter. We cater for all sorts of occasions, Wedding, funerals, birthdays, Corporate lunches and canapés."},{"name":"The London Barbecue","rating":"N/A","desc":"In 2011, we had a dream to bring barbecue, rotisserie and spit-roast catering out of back gardens and into the lives of millions via specialist outdoor, gourmet catering events delivered to tens of ..."},{"name":"Taste Mauritius","rating":"N/A","desc":"We can cater for your small event, party, corporate enquiry. Selina provides home-cooked dishes with a touch of spice, sunshine and rum in some cases! She will cook onsite for events or can provide a ..."},{"name":"Hammer & Tongs","rating":"N/A","desc":"We are Hammer & Tongs, a South African inspired Braai (BBQ) restaurant & Wine Bar in Central London (Farringdon). Taking inspiration from the traditional Braai in South Africa our menu is entirely ..."},{"name":"Que Padre Taqueria Ltd","rating":"N/A","desc":"We serve tacos and South American small plates in a modern and exciting way. For the past 10 years our team has honed their craft cooking the best in South American culinary treats. We're able to ..."},{"name":"Maria Nata","rating":"N/A","desc":"Surprise your guests with or delicious Pastel de Nata! Hire Maria Nata tricycle service or ask us to deliver to your door fresh Pastel de Nata. About Us Maria Nata is a specialised company ..."},{"name":"The Bearded Kitchen","rating":"N/A","desc":"We are a small family run company that provides beautiful chef quality food from amazingly fresh produce. We cater for events, business meetings, weddings, family parties and much more. We can provide..."},{"name":"Walter and Monty","rating":"N/A","desc":"WM Events, the product of Walter and Monty restaurant based in the city, offer a wide range of advice and support, alongside fantastic catering services, to ensure that planning your event is easy, ..."},{"name":"Ecoevents2parties","rating":"N/A","desc":"Eco Party and Event planners are a part of the growing philosophy and movement towards environmental and social sustainability. At Eco Party and Events we thoughtfully design and plan every ..."},{"name":"Solarus Kitchen","rating":"N/A","desc":"We have 20 years experience in Middle East catering. We cater for your events and supply you with all your needs from foods and chefs and watering the tables. Our kitchen is certified and with full..."},{"name":"Woolleys","rating":"N/A","desc":"Take your event or business meeting to the other level with our catering services. No matter your requirements or expectations, our Woolley’s talented chefs will be on the case and go that extra ..."},{"name":"Tempus Catering Ltd.","rating":"N/A","desc":"Tempus Catering Ltd. is based in Wandsworth, South West London and is run by Elliot and Ellie. Elliot is in charge of back of house and having trained in both Michelin and Non-Michelin starred ..."},{"name":"Food Valley Ltd","rating":"N/A","desc":"We serve up fresh & healthy Indian,Pakistani cuisine. Please choose from our selection of appetizers, soups, Tandoori specials, lamb, chicken, biriyani and much more.If you can’t make it to us – no ..."},{"name":"Master's Home Touch Caribbean Cuisine & Catering Services Ltd.","rating":"N/A","desc":"Master’s Home Touch aim is always to bring you 100% Customer satisfaction in serving the best of Jamaican Cuisine. Satisfaction in Customer Service, Satisfaction in Taste and always consistent, ..."},{"name":"D’s Chef Diaries","rating":"N/A","desc":"We provide a varied range of catering services for both intimate and larger functions. Our catering services are fit for corporate, filming and set production as well as parties and private functions."},{"name":"Bratwurst brats","rating":"N/A","desc":""},{"name":"Operation Cook Design","rating":"N/A","desc":"I am based in north London,which provides catering from 15- 60 people food is prepared in the best way from hot buffets to cold."},{"name":"Chef Gautham","rating":"N/A","desc":"I am a private chef who caterer for parties with 18 years of experience. I can make your special occasion a memorable one. Can do varied cuisines and large numbers too!"},{"name":"Yikes caterers Dellvo ltd","rating":"N/A","desc":"Founded by brothers professionally trained by London's best catering of any size. Any type of food you demand we will be able to cater for."},{"name":"Your personal chef","rating":"N/A","desc":"We're qualified chefs with many years experience so you'll be safe in our hands. We specialise in Japanese, French, Italian, Mexican, Mediterranean and Asian cuisine.​We will meet with you to talk..."},{"name":"DE-lish food","rating":"N/A","desc":"My ethnic routes are from Iran, my style of cooking is Persian and Mediterranean, I have been a chef for over 9 years in restaurants all over London, I am a qualified vegan chef and recently started ..."},{"name":"Elzo's Catering","rating":"N/A","desc":"A collective of 5* chefs at your service for any event. We cook for VIP parties, anniversaries, weddings, bachelor parties, birthdays and any sort of event. We do extraordinary cakes that everybody..."},{"name":"BOKIT'LA","rating":"N/A","desc":"Bokit'la stand for the Bokit in creole which is a freshly made baked dough (deep-fried) filled with the spice of your choice (level1 mild to level 5 extremely hot), filling of your choice (chicken, ..."},{"name":"EatFirst","rating":"N/A","desc":"EatFirst was created by award-winning Head Chef Benn Hodges. His team create small batch, handcrafted meals using high-end restaurant techniques. Our food is designed to be delivered & served cold..."},{"name":"The Tawa Hut Ltd","rating":"N/A","desc":"Authentic home-cooked food to cater to your individual taste buds Our team can create an authentic, delicious halal menu that caters to a variety of diets such as vegetarian, gluten-free, lactose..."},{"name":"Berkeley Catering","rating":"N/A","desc":"Berkeley Catering has emerged as a new brand from the very successful Il Cappuccino Catering Company which has been in business for over 20 years. We believe that as the company evolved we required..."},{"name":"Leles London","rating":"N/A","desc":"We started out as a vegetarian cafe and made the move to go fully vegan in December 2017. It’s been a real journey and incredibly fulfilling to have the opportunity to have an impact and promote ..."},{"name":"Palm Trees Catering Ltd","rating":"N/A","desc":"Canapes and Cocktail Hour An array of Delicious Canapes and Cocktails Customised for your occasion on arrival at your venue Includes: Cuisine / Waitresses / Waiters The Total Package... ..."},{"name":"Passion Events UK","rating":"N/A","desc":"Our professional team will help you organise and cater for your corporate event, summer bbq, christmas parties and special occasions such as weddings, engagement parties, birthdays and anniversaries..."},{"name":"Bare Catering","rating":"N/A","desc":"These events are either at home or at the finest locations around the country and indeed the world. Our experienced staff are always prepared to deliver above and beyond expectation and are as ..."},{"name":"Eat Sushi","rating":"N/A","desc":"Sushi is a perfect option for events and parties. It's varied, healthy, and different - and most importantly, it's fresh. There's no need for re-heating food. Our speciality is miniature bite-sized..."},{"name":"BBQ Dreamz Ltd","rating":"N/A","desc":"We create and provide Filipino inspired dishes, from crispy pork belly to satay curries. BBQ Dreamz has been voted as Londons 2nd best street food trader 3 years in a row by Timeout London and the ..."},{"name":"Food Events","rating":"N/A","desc":"Food Events is an event design and catering company, with over 20 years’ experience in professional kitchens, food writing, hospitality, and event planning, we are passionate about designing ..."},{"name":"PANCAKE EVENTS","rating":"N/A","desc":"Our service is ideal for private parties as we provide a fun and interactive catering experience, allowing guests to customize their pancakes with a variety of delicious toppings, creating a memorable..."},{"name":"Spinach And Agushi","rating":"N/A","desc":"We offer the following services: 1. Pre-boxed hot lunch deliveries 2. Street food set-up office lunch and evening service 3. Buffet service 4. Office parties"},{"name":"Conrad's kitchen","rating":"N/A","desc":"With over 20 years experience in the food industry, Conrad has been able to take Caribbean home cooked food to another level. From the street food that he cooked back home in Jamaica on his famous ..."},{"name":"Monami Eat Vietnamese","rating":"N/A","desc":"We started as a street fod vendor selling traditional Banh Mi (vietnamese baguettes) but now cater for festivals, corperate, private parties and weddings. We specialise in Vietnamese and south east ..."},{"name":"K&A Caterers","rating":"N/A","desc":"K&A Caterers specialise in providing bespoke catering solutions for corporate and private clients. Established in 2001, the company has grown significantly and we now have a number of regular ..."},{"name":"Piggies Hogroast Limited","rating":"N/A","desc":"We pride ourselves as being one of the best hog roast companies in the Southeast. We cater for weddings, anniversaries, corporate events, birthdays and charity fun raisers."},{"name":"Freak Scene","rating":"N/A","desc":"A Scott Hallsworth popup"},{"name":"La fusión UK","rating":"N/A","desc":"From small canapes to a sit down dinner we are here to help you create a unique menu for your occasion."},{"name":"Mint Caterers","rating":"N/A","desc":"We specialise in South Asian cuisine and can adapt our menus to meet our clients’ needs"},{"name":"Circus bros ltd","rating":"N/A","desc":"After Marta & Marco meet each other working at a Restaurant in London decided to start up their own dream. We love what we do, food is our passion and London our inspiration. We're determined to ..."},{"name":"Otentik Options Coterie","rating":"N/A","desc":"BONJOUR! I am Patience, the founder of Otentikoptions. I am an Event Manager and a Caterer. The company is defined by our vision and mainly our values which is to provide each client a unique ..."},{"name":"Ntaba Express","rating":"N/A","desc":"We are a Family run business who is specialises in providing Catering service for all African cuisine and Events Managements across the UK and Europe. We are a stress free service, we plan and provide..."},{"name":"Venue 5","rating":"N/A","desc":"We feel that our banqueting suite is exquisite. It may however not quite meet your requirements for your planned occasion. You are free to pick another venue of your choice and we will be there for ..."},{"name":"Village kitchen events","rating":"N/A","desc":"Welcome to VK Catering & Event Management, celebrity caterer and event management serving London, Essex, the UK and travelling internationally."},{"name":"Thyme Kitchen","rating":"N/A","desc":"Delivering fresh and tasty food for your events"},{"name":"Jabeen's Kitchen","rating":"N/A","desc":"We are a family run, local, street food and catering business called Jabeen’s kitchen (named after our mum as she taught us how to cook with her recipes, and those passed down to her from our ..."},{"name":"Get Stuffed Catering","rating":"N/A","desc":"All GSC seasonal dishes are designed to be shared, and to work as well with each other as they do on their own. Inspired by flavours from around the world, and vegetables from suppliers close by - ..."},{"name":"Jack&Ollie's","rating":"N/A","desc":"We are Jack and Ollie, two South London brothers, and we run Jack&Ollie's Catering Co! We have experience catering for 50 people to 50,000 people so we can adapt to your needs and make your event a ..."},{"name":"Marian Caterers","rating":"N/A","desc":"Entrepreneur of the year - UK Lanka Times, Community Awards 2007 Food and Beverages. Especially traditional and contemporary Sri Lankan and Japanese food."},{"name":"Suman's Variety Foods","rating":"N/A","desc":"We offer authentic taste and service, giving premium service to our clients worldwide. Contact us for a bespoke quote."},{"name":"Miss Dee's Catering","rating":"N/A","desc":"At Miss Dee's Catering we offer affordable, high quality and most importantly gorgeous food for office meetings, conferences, event catering and weddings. We specialise in executing authentic ..."},{"name":"koli's kitchen Ltd,","rating":"N/A","desc":"Be it a Pre-Wedding party, Mehendi, Shagan, Chunri ceremony, Wedding, Reception, Birthday party or Corporate event. We at Koli's kitchen tailor-make the packages to meet the client's requirements and ..."},{"name":"Sonali Shah Food","rating":"N/A","desc":"Whatever the occasion; whether it’s an anniversary dinner party, a birthday afternoon tea or canapés for 50, if you’re looking the sophistication that a professionally-trained chef can bring, you’ve ..."},{"name":"Marian Caterers","rating":"N/A","desc":"We are specialized in Sri Lankan, Indian (North and South), Indo-Chinese, Japanese and English cuisine. We have been catering in the UK for more than fifteen years."},{"name":"Detox Kitchen","rating":"N/A","desc":"Healthy, nutrient-dense, delicious food that is gluten, dairy and refined sugar-free. Prepared with real ingredients cooked from scratch daily in our kitchen. The meals are nutritionally ..."},{"name":"KamPai","rating":"N/A","desc":"Whether its a sushi bar, sushi canapés or sushi buffet you are after, we will work with you to create a bespoke menu of fine Japanese seasonings with carefully selected seasonal ingredients to suit ..."},{"name":"Bombastic Catering Services","rating":"N/A","desc":"FOOD VAN HIRE SERVICES This service is for food van hire, we cover areas within central London, M25, M4, whether you need catering for Fashion Photoshoot, Film Crew, Business Lunch, Festivals, Street..."},{"name":"PRINCESSE D'ISENBOURG","rating":"N/A","desc":"Top quality Caviar, foie gras, smoked salmon smoked sturgeon, white truffles and black truffles canapes ."},{"name":"Delhi Live","rating":"N/A","desc":"We are an authentic Indian restaurant in Romford We offer indoor catering services for upto 60 people and outdoor catering for 20 - 1000+ guests. We specialise in Indian food."},{"name":"The Larder","rating":"N/A","desc":"From intimate dining to your big day, afternoon tea to birthday parties, our experienced team cater across North and East London"},{"name":"Fair & Square Catering","rating":"N/A","desc":"Healthy Options Great taste is the name of the game and we're committed to stepping up to the plate. Our goal is provide delicious, natural options. That's why we prepare all of our meals with fresh..."},{"name":"For food sakes","rating":"N/A","desc":"We specialise in Portuguese street food but can do whatever you require really, if you prefer we can do burgers, hot dogs and chips, hot drinks, vegan options."},{"name":"Woodford Original Jerk","rating":"N/A","desc":"We provide authentic Caribbean food I have a mobile food trailer with all cooking equipment inside. It has a five-star rating from the local council"},{"name":"Avocadium","rating":"N/A","desc":"Your top choice for a healthy treat, serving nutritious breakfast, lunch, and desserts. All recipes are lovingly created by our nutritionist using the highest quality ingredients including a number of..."},{"name":"Fresh N Funky Catering","rating":"N/A","desc":"Whether you are responsible for organizing a summer barbecue for a wedding, or a pop-up coffee shop for a trade show, or even your next Christmas party for your company, you can rest assured your next..."},{"name":"TaiwaneseFood","rating":"N/A","desc":"Catering Canaan Foods is an international catering company with catering companies in Taiwan, China, New York, Los Angeles, Houston, Spain, and Johannesburg, South Africa. He has rich experience in ..."},{"name":"Curry Nation","rating":"N/A","desc":"Our catering offers a wide array of delectable dishes right at your doorstep. From hot curries to sweet treats and a plethora of side dishes - Indian recipes are incredibly versatile and vibrant..."},{"name":"Jerome Roelens Ltd","rating":"N/A","desc":"At Jerome Roelens, we have over 20 years of experience in providing catering services for a range of events. We are dedicated to working closely with our customers to deliver the best catering ..."},{"name":"Abd El Wahab","rating":"N/A","desc":"We take time to fully understand your requirements and deliver catering to the highest standards of presentation, service, and value for money using the finest ingredients, to ensure your event ..."},{"name":"Marlon's Kitchen Ltd","rating":"N/A","desc":"We specialise in Latin fusion, but our classically trained Colombian chef is just as happy cooking traditional dishes for less adventurous clients. We have experience in private and corporate ..."},{"name":"El Food Flow","rating":"N/A","desc":"Fresh and tasty food for your event! - Private events - Birthday parties, anniversaries, hen parties and small... - Corporate events - Food stalls"},{"name":"My Choice Catering Services","rating":"N/A","desc":"My choice in London was created from our small family home kitchen, cooking authentic homemade Ghanaian dishes with the same values and recipes like the one back home in Ghana"},{"name":"QOC Events","rating":"N/A","desc":"We help create outstanding events ranging from children's parties to baby showers & all special occasions. Our reputable & reliable service is tailor-made to suit your needs and will guarantee your..."},{"name":"Waffle Side Chick","rating":"N/A","desc":""},{"name":"The Braizen Kitchen","rating":"N/A","desc":"In 2015 Clare O'Reilly set up the braizen kitchen with a passion for good food to both inspire and comfort. We believe in simple but delicious food that brings people together and gets them talking. ..."},{"name":"Ummah catering and events","rating":"N/A","desc":"Whether you require catering for a wedding or a corporate event. We are your local Asian catering company and welcome customers from across the whole of London."},{"name":"Cow and Field","rating":"N/A","desc":"Our food is fresh, colorful, bountiful and inspired by our travels to the Middle East, Asia, and South America. We work with you to design a bespoke menu for an unforgettable dining experience. ..."},{"name":"Gettin Piggy With It","rating":"N/A","desc":"We specialise in party catering for weddings, corporate events, parties & celebrations and festivals. Whatever the occasion, when you book with Gettin Piggy With It, you can leave all the hard ..."},{"name":"Chef Darius","rating":"N/A","desc":"Chef Darius is a personal and private chef service with over 35-years of experience within the hospitality industry. offering exclusive dining service, bringing the restaurant experience to our ..."},{"name":"Forage and Feast","rating":"N/A","desc":"Show-stopping social eating for all occasions."},{"name":"Shikaar Foods","rating":"N/A","desc":"We offer unique dining experiences to satisfy all aspects of exquisite cuisine. Our one of a kind Signature dishes include Butter Boar, Venison & Foie Gras tikkis, Goat Laal Maas & Iberico Tikka. We ..."},{"name":"To Kefi Mas","rating":"N/A","desc":"Throwing a dinner party always seems like such a fabulous idea, doesn’t it? And it is, of course, as you look round the table at smiling faces, empty plates and have two minutes to bask in the glory ..."},{"name":"Lancewood Row Catering","rating":"N/A","desc":"No event is to small for us. Lancewood row catering service are a professional and trustworthy company with over 20 years of experience. We supply authentic cuisine for all cultures and all occasions..."},{"name":"Andrews Catering","rating":"N/A","desc":"We provide small and large settings for weddings, corporate, birthdays and much more. Experienced in different types of cuisine, please get in touch for more details."},{"name":"Fiore Truck","rating":"N/A","desc":"We would like to share the passion for food and high-quality products. A professional couple that enjoyed ten years in hospitality and fine dining, ready to delight with their traditional italian ..."},{"name":"The Balance","rating":"N/A","desc":"We are a versatile team that cater to all kind of events including weddings, corporate and private parties.​Using the best ingredients, we create customised menus that will tease your pallets and ..."},{"name":"Shalimar Caterers UK","rating":"N/A","desc":"We have been cooking Indian dishes for well over three decades"},{"name":"New Dawn Catering","rating":"N/A","desc":"We have a reputation for providing special and personal events tailored to the specific requirements of the client. We also cater to corporate events of which our team has a wealth of experience. ..."},{"name":"Hutumia","rating":"N/A","desc":"Our catering services are tailored to meet the requirements of corporate events, weddings, festivals private parties/functions, office luncheons, children's parties, fun days even barbeques. Planning ..."},{"name":"Seasoned Express","rating":"N/A","desc":"We have 40 years' experience as caterers, providing delicious, fresh, seasonal and locally sourced menus. We can provide anything from sandwiches, buffets to three course menus for up to 2,000 guests"},{"name":"Phirsaal Caterers","rating":"N/A","desc":"Fresh and tasty"},{"name":"Penelope Evans Catering","rating":"N/A","desc":"We have a passion for providing outstanding service. Food makes us smile with joy. We take pride in what we produce and serve. No job is too small or too big and all of our clients needs are lo"},{"name":"JKH FIne DIning","rating":"N/A","desc":"Jonathan Kara-Hughes is an experienced and talented chef who has worked in some of London's best restaurants. Jonathan has extensive knowledge in both culinary and customer service and acquires an ..."},{"name":"Boutwoods Kitchen","rating":"N/A","desc":"Boutwood’s Kitchen was created by Angela Boutwood. Her passion for food started from a young age growing up in and around her family run Catering Business. Boutwood’s Kitchen, Angela and her team..."},{"name":"Party Art London","rating":"N/A","desc":"We specialised in children birthday parties and company events but we can prepare wonderful wedding options as well. If you want a complete catering service or just some cakes and sweets, our ..."},{"name":"El Shams","rating":"N/A","desc":"Our aim is to create an experience for clients to encounter middle eastern dining in the heart of their home. Serving fresh soulful family recipes, El Shams holds on to traditional principles by ..."},{"name":"Fries and Caviar","rating":"N/A","desc":"The Fries & Caviar taste experience awaits you to embark on an exciting culinary celebration, surrounded by exceptional food, impeccable service and the ones you love. Our ethos centres around ..."},{"name":"Food Fusion 95","rating":"N/A","desc":"We cater for Parties, Christenings, Private Events and Master Classes."},{"name":"Woodfire Kitchen","rating":"N/A","desc":"Woodfire Kitchen provide a gourmet catering service. We are a catering company who specialises in delivering unique flavours, offering an authentic mix of Caribbean and British cuisine. Our mission is..."},{"name":"Jonny's Paellas","rating":"N/A","desc":"If you are looking to make your party special, Jonny's Paellas catering service brings you a piece of Spain to your party. With the best flavour of the authentic Spanish Paella, you will not only ..."},{"name":"Food-4-Thoughts Catering and Cafe","rating":"N/A","desc":"If you are looking for a high quality, dependable caterer for your Northwest wedding,,look no further than Garden of England Catering with over 25 years experience we industry experts in providing a ..."},{"name":"Bites & Beats London","rating":"N/A","desc":"I cater for cold and hot finger buffet food, grazing tables, afternoon teas with drop off options. I can adapt menus to suit most requests and all the food I make is homemade, using ethical and ..."},{"name":"KG Food","rating":"N/A","desc":"We offer traditional Jamaican meat, fish and vegan dishes catering to all appetites."},{"name":"Planned & Plated","rating":"N/A","desc":"Here at Planned and Plated, we discuss your requirements in terms of catering, supplies, and event management to the very last detail, making sure you receive our full support. Private full service..."},{"name":"Roobarb's","rating":"N/A","desc":"A small-scale, one-woman-band serving up seasonal dishes, that are vegan, made from surplus fresh produce and packed full of flavour. Tailored to fit anything from supper clubs to weddings."},{"name":"Bespoke Chef Ty","rating":"N/A","desc":"Adding the 'Wow' factor to your event"},{"name":"Taverna Catering","rating":"N/A","desc":"We are Taverna Catering, a catering company based at the prestigious \"The Parsons Green Sports & Social Club\" in London and willing to service to any area in the United Kingdom. Our team of culinary ..."},{"name":"The Cook & The Butler Event Catering Ltd","rating":"N/A","desc":"The Cook & The Butler Event Company is an outstanding London Catering company with over ten years London experience in the art of food service and professional hospitality management. The Company has ..."},{"name":"Goodallfoods","rating":"N/A","desc":"We provide bespoke catering experiences, private chefs and hospitality consultancy for any occasion, including corporate meetings, company seminars, meetings, parties, training courses, product ..."},{"name":"VK Events","rating":"N/A","desc":"Bringing inspiring dishes with the best ingredients for a wide variety of occasions and events. We cater for all occasions including corporate events, celebrations, indoor and outdoor catering (BBQ..."},{"name":"Seasons Organic","rating":"N/A","desc":"Our Menus Flourish Goodness | Through their uniquely creative menus, the chefs have been able to cater to a range of distinctive tastes and thus produce and supply the highest quality affordable ..."},{"name":"Salters Events","rating":"N/A","desc":"Salters Events are a husband and wife team, Ian and Robyn, based in South East London, with 40 years combined experience in the catering industry. We pride ourselves on our well-sourced, seasonal ..."},{"name":"Nu Nosh","rating":"N/A","desc":"For your events"},{"name":"The Graceful Kitchen","rating":"N/A","desc":"We specialise in creating an amazing experience for our customers whatever the occasion may be. Our highly dedicated and committed team is always taking care to make our customers happy and provide ..."},{"name":"Olmec Eats","rating":"N/A","desc":"We are street food and events family run catering company who have been running since 2017, we pride ourselves in cooking the best and freshest ingredients fusing with the rest of the world to make ..."},{"name":"Sushi Queen Sushi Catering & Sushi Class","rating":"N/A","desc":"Keiko’s passion for food, innovative food creation, cooking, and teaching has led her to become a leader in healthy Japanese cooking. She expertly combines traditional techniques with modern flair to ..."},{"name":"Bobo Social","rating":"N/A","desc":"Our menu caters to every occasion and dietary requirement. If you are vegan, vegetarian, or avoiding gluten, we’ll have you covered. Great food, good wine, and friendly service are the order of the ..."},{"name":"Taste for Good Vibe Events","rating":"N/A","desc":"We are members of NCASS and have all H&S assessments up to date. We hire out catering equipment like slush machines, ice cream, candy floss, popcorn, gazebos and other party features, such as bouncy ..."},{"name":"Bubbles & Graze","rating":"N/A","desc":"Specialising in graze tables to cater to all dietary requirements. Also, afternoon tea caddies and graze platters for smaller events. Catering for Children’s themed birthdays is something we ..."},{"name":"Kal's Kitchen","rating":"N/A","desc":"I’m Kal! I’m a chef who specialises in plant-based food, health-conscious, delicious food with a sustainable twist. I’m based in London, and have catered events for private clients and household ..."},{"name":"Smith's Catering","rating":"N/A","desc":"We’re always on time and developing our menus, as well as our service to meet clients’ needs. As we see it, every event is a chance to book a regular client. So we always uphold our reputation for ..."},{"name":"Black Star Kitchen","rating":"N/A","desc":"Covering all events"},{"name":"Bespoke Occasions","rating":"N/A","desc":"Bespoke Occasions specialises in collaborating with the best Bespoke Caterers and Private Chefs, cooking luxury food tailored for your private and corporate events. We provide the finest seasonal ..."},{"name":"Finotaste","rating":"N/A","desc":"We offer bespoke menus designed to measure your personal demands and fulfilments, as well as to serve dishes that will provide an amazing taste and an amazing look to your guests."},{"name":"K.a.w.c.c.c","rating":"N/A","desc":"I provide food for weddings, small parties, funerals, or any functions. I specialise in 3D fruit displays, savoury and sweet platters I can provide servers for big and small events if needed. ..."},{"name":"Intrepid Bakers","rating":"N/A","desc":"Company is versatile, could do with success from homemade pies to canapes, cooked food (moussaka, lasagne, slow cooked lamb, imam baildi, stuffed peppers etc) cakes, wine and cocktail parties - ..."},{"name":"Homemade Curries","rating":"N/A","desc":"Authenticity and innovation are at the heart of Homemade Curries. Launched in 2018, this company aims to delight you with exciting cuisine in a BIG way! We envisage offering a culinary experience ..."},{"name":"Bonaparte Barbecue","rating":"N/A","desc":"Bonaparte Barbecue began in the summer of 2020 in Kensal Rise, London, when we started smoking on a humble Napoleon bullet. Since then, we have honed our craft, guided by the sage wisdom of our ..."},{"name":"Passa Passa London","rating":"N/A","desc":"Half Jamaican and Antiguan Head Chef Zana Millen was born in Hackney with an extensive culinary background in Passa Passa London and want her cultural ingredients and traditional recipes to be ..."},{"name":"Twist & Grill","rating":"N/A","desc":"Want to plan a family get-together, a reunion, a yard party, or just want to have a nice meal with delicious grilled meat in London. Twist & Grill is ready to serve your needs. Twist & Grill as its ..."},{"name":"ST Foodies Limited","rating":"N/A","desc":"I am an international and celebrity private chef based in the city of London. STFOODIES Limited is an Luxury Caribbean company that specialises in event catering and private dining experiences. We add..."},{"name":"Pink Diamond Catering","rating":"N/A","desc":"Whatever the occasion - a birthday, Wedding, Confirmation, dinner party or any family celebration we can make your special day perfect."},{"name":"Denise's Personal Catering","rating":"N/A","desc":"Including: • canapés • multiple course food menus • buffets • grill and bbq services • bar services • DJ services,"},{"name":"Le Grand Chef","rating":"N/A","desc":"Whether it’s a large-scale corporate event for 200, or a small intimate dinner party for two, Le Grand Chef has covered it. Franck and his team of chefs will listen, advise and guide, and organise a ..."},{"name":"Platters Galore","rating":"N/A","desc":"Tastes as good as it looks!"},{"name":"Salsa Rose Ltd","rating":"N/A","desc":"We are a London-based company that creates magical catering, cocktails, and more for events of all shapes and sizes. Salsa Rose focuses on simplicity and seasonality, championing local suppliers and ..."},{"name":"Gibbons Catering","rating":"N/A","desc":"Gibbons Catering is a family run business with a wealth of experience specialising in Fabulous Buffets be it finger, fork or plated, delicate canapés & grazing tables and provide wedding catering, ..."},{"name":"Datz A Wrap","rating":"N/A","desc":"Let us feed your imagination and delight your taste buds with individually designed menus tailored to your special occasion. Datz a Wrap – from weddings to birthdays and anniversaries, our caterers' ..."},{"name":"Right Choice Caterers Ltd","rating":"N/A","desc":"With over 40 years of experience, we cater to parties of 2 to 1000 guests. Our fusion of options of Caribbean, African and Asian cuisine draws on a lifetime of skills and the knowledge of our chefs. ..."},{"name":"Alaleke Event","rating":"N/A","desc":"Our Services We are a Multi-cultural Hospitality service company, that provides Multi-cultural Catering Services in styles for all occasions- Weddings, Birthdays, Corporate Events, Private Dining ..."},{"name":"Trini Caribbean Catering","rating":"N/A","desc":"Our food is based on dishes from the Caribbean including the islands of Barbados, Trinidad, and Tobago, and Jamaica. All our meats are marinated overnight so the flavour is absorbed and then it is ..."},{"name":"FEBE Restaurant","rating":"N/A","desc":"We can offer catering solutions tailed for all types of functions: finger food, canapes (hot and cold), and a buffet. Our full service experience also includes waiting staff, professional chefs and ..."},{"name":"Maur’s Jamaican Kitchen","rating":"N/A","desc":"Fresh and tasty and adding the wow to any event"},{"name":"New Quebec Catering Ltd","rating":"N/A","desc":"At New Quebec Catering, we take great pride in our ability to cook the tastiest and most diverse foods made from local produce. Our chefs have daily specials and our menus are tailored to our customer..."},{"name":"Indian Aroma Cuisine Limited","rating":"N/A","desc":"We're happy to announce that Indian Aroma Restaurant has won the Curry Life Editor's Award for 2022, adding to our collection of awards. Our dedicated catering team has delivered over 1000 ..."},{"name":"Caribburton","rating":"N/A","desc":"Caribburton is a professional & experienced, full-time catering business. We offer flexible and friendly Caribbean catering with full-flavored food influenced by our Jamaican heritage. We cater for ..."},{"name":"Afro-Fusion Barbecue","rating":"N/A","desc":"The food takes you on a high-end gastronomic tour of afro-fusion dishes ranging from barbecued and grilled meats to chicken and seafood seasoned with spices and flavours from west Africa. Barbecued ..."},{"name":"Tahinee","rating":"N/A","desc":"As a new business with plenty of background, Tahinee offers a modern twist to Lebanese food all the while keeping all the classic flavours and dishes alive. At Tahinee we love food and because of that..."},{"name":"Steven Moore Relief Chef","rating":"N/A","desc":"It is my aim to take the stress out of having to provide food for your parties/events. I only use fresh products which are traceable where I can depending on time constraints and dietary ..."},{"name":"Ida's Kitchen","rating":"N/A","desc":"Gourmet caterer since 1999 serving fresh, healthy, handmade food"},{"name":"Cristi’s food","rating":"N/A","desc":"We are a team of professional chefs with over 20 years of experience in various restaurants around London who now dedicate ourselves to providing tailored culinary experiences. To us, flavour, ..."},{"name":"The Grazing Buddha","rating":"N/A","desc":"Firstly let me take this opportunity to introduce myself and the product. We are a family business with a wealth of 35 years within the catering industry, since we established The Grazing Buddha Brand..."},{"name":"Beyond Flavour","rating":"N/A","desc":"Taste, smell, and vision, are the particular senses we are focused on to create enjoyment and comfort when eating or drinking for an absolute experience for our clients and their loved ones. With ..."},{"name":"Ma Petite Cocotte","rating":"N/A","desc":"By using seasonal ingredients, Ma Petite Cocotte creates menus that fit both budgets and visions. Whatever your event needs are, we can help! We can deliver stylish canapés, seasonal lunches, or 3-..."},{"name":"Swaad Punjab Da","rating":"N/A","desc":"We are bringing the traditional foods and flavours from our heritage from Punjab and adding a modern twist to make it more unique and pleasing for clients to see. We aim to provide 100% ..."},{"name":"Dohmu","rating":"N/A","desc":"Visit our website and contact us directly for a quick response Introducing Dohmu - a culinary experience like no other. Our specialty lies in modern fusion cuisine, where every dish is meticulously..."},{"name":"Goose Box Catering","rating":"N/A","desc":"We can cater a variety of events such as breakfast, lunch, dinners and boardroom style as well as canapés & drinks reception."},{"name":"Aunty Madge Caribbean Cuisine","rating":"N/A","desc":"If you're looking for food to take your event to the next level, look no further than Aunty Madge Caribbean Cuisine. Our skilled chefs create delicious mouth-watering dishes that transport your taste ..."},{"name":"Betti's","rating":"N/A","desc":"Betti's food is genuine, uncomplicated and generous in flavour. It is inspired by the recipes of her childhood in Tuscany and by those collected after many happy trips to Sicily"},{"name":"Ziteq Foods Ltd","rating":"N/A","desc":"I am caterer who provides West African and Caribbean cuisine for small or large scale events such as weddings, birthdays and carnivals etc. I can provide for local businesses as well."},{"name":"Jaffna Kitchen Ltd","rating":"N/A","desc":"Jaffna Kitchen Ltd is your passport to an extraordinary culinary journey, dedicated to bringing the vibrant flavors of Sri Lankan and South Indian cuisine to your events. With our roots deeply ..."},{"name":"Blackstars Catering","rating":"N/A","desc":"BlackStars Catering is a unique food business founded by two Caribbean chefs who met in college and bonded over their love of music. They are professionally trained and cater for all types of food and..."},{"name":"Bar B Lou","rating":"N/A","desc":"I’m Louis, better known as Lou. I have been a chef for 18 years. Been around the block and back. My journey has taken me from the highest end of the industry in 5 star hotels and fine dining ..."},{"name":"London Braai Company (BBQ)","rating":"N/A","desc":"London Braai Company is a bbq catering business. We are a family team, that has a love for bbq. We bbq chicken, steaks, lamb chops, boerewors (South African sausage) sausages, cheeseburgers, vegan..."},{"name":"Sareli Events","rating":"N/A","desc":"We provide a wide variety of menus, party food and much more. Please ask for more information"},{"name":"Indulge dining","rating":"N/A","desc":"We can cater for all size events; weddings, large corporate canapé parties, catering events or small intimate dinner parties. Chef Andy Bowler uses finest of produce from some of the best suppliers in..."},{"name":"Michele’s Hideout","rating":"N/A","desc":"We specialise in buffet-style food and special occasions, we can also assist you with any recommendations you may need. We are Caribbean, southeast Asian, caterer but can also adapt are menu for all ..."},{"name":"Marias Greek Buffet","rating":"N/A","desc":"Celebrate your special event with beautiful Food from Maria's Greek Buffet. Exquisite & creative cuisines, a friendly atmosphere and highly professional staff will make your special day beautiful & ..."},{"name":"Eduardos Cuisine","rating":"N/A","desc":"I’m a pro chef and I’ve been working in hospitality for 10 years now. I have been working as a chef for 5 years in London and I have worked in different venues and many prestigious companies, ..."},{"name":"Eduardo’s Cuisine","rating":"N/A","desc":""},{"name":"Brazilian Empire","rating":"N/A","desc":"We provide delicious food ranging from street food to high-tier catering for all event types. We use the best produce and cook all food in-house making sure we never miss out on maximum flavour. ..."},{"name":"Britain Loves Baking","rating":"N/A","desc":"We offer a corporate service for up to 500 guests and our wonderland team offers unique food experiences for private clients that add the wow factor to every event"},{"name":"Hearth Bakery","rating":"N/A","desc":"We are a social enterprise bakery & eatery working directly with farmers to create a localised food network which is reflected in our seasonal and colourful menus. We are open for retail trade ..."},{"name":"The Two Foodies Ldn","rating":"N/A","desc":"Delicious Caribbean and American-inspired flavours. It’s not just about the food, it’s about the presentation and the entire experience. We provide catering services for every event, whether it’s a ..."},{"name":"F.X.S Group Ltd","rating":"N/A","desc":"Delectable food is a conversation starter and an experience. It delights the senses of everyone at the table and puts a smile on their face. We welcome you all to indulge in a flavourful ..."},{"name":"Sticks'n'Sushi","rating":"N/A","desc":"Sticks 'n Sushi offers an exquisite catering experience that combines the flavours of Japan and the culinary excellence of the Nordic region. With a focus on quality ingredients, expert craftsmanship..."},{"name":"Dream Experience","rating":"N/A","desc":"We are a team of party planners with our own in house DJ’s, entertainers, party suppliers and event decorators specialising in weddings and childrens parties. We also cater to birthday parties (no ..."},{"name":"BOABAB","rating":"N/A","desc":"BOABAB Picnic is a full-service luxury event planner that creates unforgettable experiences. Filled with stylish decor, a curated menu, and picture-perfect opportunities.. Our goal is to make ..."},{"name":"Don Arancini","rating":"N/A","desc":"Don Arancini is specialized in Premium Sicilian gourmet catering food, including the famous Sicilian Arancini rice balls, the Gluten free cannoli cookies and many other specialty regional products, ..."},{"name":"Dom Catering","rating":"N/A","desc":"We are more than just a catering company. We aim to make you feel welcomed, listened and taken care of, all in an inviting atmosphere where every guest is the centre of attention. Your preferences ..."},{"name":"Cloud 9 Catering and Events","rating":"N/A","desc":"Our heart and soul lie in our unwavering passion for great food. We believe in the power of culinary art to ignite emotions, foster connections, and create unforgettable moments. Sourcing the ..."},{"name":"Racheal Cooks Ltd","rating":"N/A","desc":"Racheal Motojesi is the passionate founder of Racheal Cooks an African Food Brand, dedicated to her West African Heritage. After quitting her senior management corporate job, Racheal is slinging out..."},{"name":"Samson Catering","rating":"N/A","desc":""},{"name":"Ackeee Tree","rating":"N/A","desc":"Ackeee Tree We specialise in FEEL GOOD FOOD. We provide services in and out of the home. We can cater any event of any size as well as conduct in-home cooking events. Our Rum-Punch is signature ..."},{"name":"Ramekins & Wine","rating":"N/A","desc":"At Ramekins & Wine we're a premium, 5 star reviewed (Google) catering business specialising in wine and food pairing. We started the business to spread the joy we get from food and wine, and ..."},{"name":"Vick Nathan Kitchen","rating":"N/A","desc":"Specialties in India and Middle East food, fine dining, bespoke menu"},{"name":"Arens & Heriot","rating":"N/A","desc":"Whether you are planning the wedding of a lifetime, a surprise birthday party for a loved one or a business launch party, Arens & Heriot Caterers can help and assist you create that special event."},{"name":"Arens & Heriot","rating":"N/A","desc":"Our business has been family-owned for several generations, with a rich history and strong values. This heritage gives us a unique advantage in terms of trust, reliability, and a genuine passion for ..."},{"name":"Zest Kitchen","rating":"N/A","desc":"Feel Good Food, Inside & Out Want beautiful bao buns, zingy curries and stunning sweet treats at your event? Zest Kitchen has you covered. We have catered at weddings, corporate events such as ..."},{"name":"Royal Banquet","rating":"N/A","desc":"Royal Banquet Catering's private chef provides exquisite fine dining gourmet catering whether it is a romantic 3 course dinner for two we also provide catering for weddings, parties, and events. ..."},{"name":"Wings Factory Kingston","rating":"N/A","desc":"We specialise in food catering for events for 10 people, all the way to 100 people. We offer soul food which emphasis on fried chicken wings, boneless bites, Mac and cheese and much more. Ideal for ..."},{"name":"Mai Dim Sum","rating":"N/A","desc":"With our commitment to culinary excellence and the art of handcrafted dim sum, we bring a touch of elegance and sophistication to every event. Whether you're hosting a corporate gathering, a ..."},{"name":"Talk Food to Me","rating":"N/A","desc":"Take control of any kind of occasion such as corporate events with up to 150 people, hen do and stag do parties, afternoon tea, wedding anniversaries, birthday parties or casual family dinners. Focus ..."},{"name":"Joy’s Caribbean Fusion (vegan)","rating":"N/A","desc":"The most rewarding thing about my job is the look of absolute satisfaction on the faces of my customers after trying our dishes."},{"name":"Fuseless Fan","rating":"N/A","desc":"Depending on the event, we can provide a food service alongside our mobile cocktail bar. We do not serve full meals or do table service, our food format is buffet style only and including finger foods..."},{"name":"Muya","rating":"N/A","desc":"“By combining Ethiopian cuisines with other world cuisines, it allows me to explore a new unique experience, while adding my creative touch to classic. Whether you are looking for a canape, buffet..."},{"name":"Jerk Garden","rating":"N/A","desc":"For your events!"},{"name":"Shoreditch Eatery","rating":"N/A","desc":"Spear headed by Chef with 2+ decades of International experience, cooking for celebrities, Destination weddings, BBC, Internal support for Michelin chefs, etc., Hands on experience available to ..."},{"name":"Tastylicious Catering","rating":"N/A","desc":"We specialize in crafting unforgettable dining experiences. Our talented team brings culinary expertise and creativity to every event, ensuring your occasion is a delectable success."},{"name":"Mocha and Latte Catering","rating":"N/A","desc":"We are committed to using fresh, high-quality ingredients in our dishes and providing exceptional service to ensure that every occasion we cater is a success. Our team has years of experience in ..."}]}